RIET/src/InformationRegisters/TransportAvailabilityStatus/TransportAvailabilityStatus.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>TransportAvailabilityStatus</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Status</name>
    <type>
      <types>EnumRef.TransportAvailabilityStatuses</types>
    </type>
  </resources>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Trip</name>
    <type>
      <types>DocumentRef.TripNonLawsonCompanies</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Transport</name>
    <type>
      <types>CatalogRef.Transport</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/Enums/TypesOfTransport/TypesOfTransport.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>TypesOfTransport</name>
  <enumValues>
    <name>Own</name>
  </enumValues>
  <enumValues>
    <name>Rental</name>
  </enumValues>
  <enumValues>
    <name>CallOut</name>
  </enumValues>
  <enumValues>
    <name>RentalAutomatic</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Enums/TransportAvailabilityStatuses/TransportAvailabilityStatuses.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>TransportAvailabilityStatuses</name>
  <enumValues>
    <name>Available</name>
  </enumValues>
  <enumValues>
    <name>NotAvailable</name>
  </enumValues>
  <enumValues>
    <name>StartRental</name>
  </enumValues>
  <enumValues>
    <name>EndOfRental</name>
  </enumValues>
  <enumValues>
    <name>InRepair</name>
  </enumValues>
  <enumValues>
    <name>Decommission</name>
  </enumValues>
</mdclass:Enum>

RIET/src/InformationRegisters/TransportAvailabilityStatus/Forms/ФормаЗаписи/Module.bsl
&НаКлиенте
Процедура StatusНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Запись.Transport) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"First select 'Transport'!",
			, "Transport", "Запись");
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
	НастроитьСписокВыбораTransportStatuses();
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьСписокВыбораTransportStatuses()
	      		
	НовыйМассивПараметров = Новый Массив;
	НовыйМассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", 
		ПолучитьМассивСтатусовПоТипуТранспорта(Запись.Transport)));
	НовыеПараметрыВыбора = Новый ФиксированныйМассив(НовыйМассивПараметров);
	Элементы.Status.ПараметрыВыбора = НовыеПараметрыВыбора;
	
КонецПроцедуры	

&НаСервереБезКонтекста
Функция ПолучитьМассивСтатусовПоТипуТранспорта(Transport)
	
	НовыйМассив = Новый Массив;
	TypeOfTransport = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Transport, "TypeOfTransport");
	
	Если TypeOfTransport = Перечисления.TypesOfTransport.Own Тогда
		
		НовыйМассив.Добавить(Перечисления.TransportAvailabilityStatuses.InRepair);
		НовыйМассив.Добавить(Перечисления.TransportAvailabilityStatuses.Decommission);
		
	ИначеЕсли TypeOfTransport = Перечисления.TypesOfTransport.Rental Тогда
		
		НовыйМассив.Добавить(Перечисления.TransportAvailabilityStatuses.StartRental);
		НовыйМассив.Добавить(Перечисления.TransportAvailabilityStatuses.EndOfRental);
				
	КонецЕсли;
	
	НовыйМассив.Добавить(Перечисления.TransportAvailabilityStatuses.Available);
	НовыйМассив.Добавить(Перечисления.TransportAvailabilityStatuses.NotAvailable);
	
	Возврат НовыйМассив;
	
КонецФункции
